In [2]:
import pandas as pd
import numpy as np

In [4]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

In [6]:
df.groupby(['Team','Points']).groups #groupby takes only one value. so to pass multiple args use list.

{('Devils', 673): [3], ('Devils', 863): [2], ('Kings', 741): [4], ('Kings', 756): [6], ('Kings', 788): [7], ('Kings', 812): [5], ('Riders', 690): [11], ('Riders', 694): [8], ('Riders', 789): [1], ('Riders', 876): [0], ('Royals', 701): [9], ('Royals', 804): [10]}

In [8]:
print(df.groupby('Year')) # without .groups returns only the object
print(df.groupby('Year').groups) # using .groups returns the groups of the dataframe

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F11BA38EB0>
{2014: [0, 2, 4, 9], 2015: [1, 3, 5, 10], 2016: [6, 8], 2017: [7, 11]}

In [12]:
#get_group()
grp1 = df.groupby('Year')
print(grp1.get_group(2016))
#print(grp1.get_group(2014))
#df.groupby('year').get_group(2016)

     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694

In [13]:
grp1['Points'].agg(np.sum) # .agg performs aggregate function given within brackets to each group.

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [16]:
#to find the size of each group
grp1.agg(np.size)

      Team  Rank  Points
Year
2014     4     4       4
2015     4     4       4
2016     2     2       2
2017     2     2       2

In [28]:
grp2=df.groupby('Team')
print(grp2['Points'].agg([np.mean,np.sum,np.std]))# pass multiple values to .agg()

          mean   sum         std
Team
Devils  768.00  1536  134.350288
Kings   774.25  3097   31.899582
Riders  762.25  3049   88.567771
Royals  752.50  1505   72.831998

In [30]:
score = lambda x:(x-x.mean())/x.std()*10
print(grp2.transform(score))#.tranform changes the grp2(given dataset) to score.

         Rank       Year     Points
0  -15.000000 -11.618950  12.843272
1    5.000000  -3.872983   3.020286
2   -7.071068  -7.071068   7.071068
3    7.071068   7.071068  -7.071068
4    5.000000 -11.618950 -10.423334
5   11.666667  -3.872983  11.834011
6   -8.333333   3.872983  -5.721078
7   -8.333333  11.618950   4.310401
8    5.000000   3.872983  -7.705963
9    7.071068  -7.071068  -7.071068
10  -7.071068   7.071068   7.071068
11   5.000000  11.618950  -8.157595

In [40]:
grp2.filter(lambda x:len(x)>3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [52]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print(pd.merge(left,right,on='subject_id'))# merging based on id. by default its inner join

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

In [45]:
print(pd.merge(left,right,on='id',how='right'))#right join

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [48]:
print(pd.merge(left,right,on='subject_id',how='left'))#left join

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

In [51]:
print(pd.merge(left,right,on='subject_id',how='outer'))#outer join

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   5.0  Betty
5   NaN     NaN       sub3   3.0   Bran

In [54]:
print(pd.date_range('01/01/2022',periods=5))#creates the ranges of date from the start date(1-1-2022) for 5days.by default it days

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05'],
              dtype='datetime64[ns]', freq='D')

In [56]:
print(pd.date_range('01/01/2022',periods=5,freq='M'))#'M' specifies months

DatetimeIndex(['2022-01-31', '2022-02-28', '2022-03-31', '2022-04-30',
               '2022-05-31'],
              dtype='datetime64[ns]', freq='M')

In [57]:
print(pd.date_range('01/01/2022',periods=5,freq='W'))#'W' specify weeks

DatetimeIndex(['2022-01-02', '2022-01-09', '2022-01-16', '2022-01-23',
               '2022-01-30'],
              dtype='datetime64[ns]', freq='W-SUN')

In [61]:
start = '01/01/2022'
end = '05/05/2022'
print(pd.date_range(start,end,freq='W'))

DatetimeIndex(['2022-01-02', '2022-01-09', '2022-01-16', '2022-01-23',
               '2022-01-30', '2022-02-06', '2022-02-13', '2022-02-20',
               '2022-02-27', '2022-03-06', '2022-03-13', '2022-03-20',
               '2022-03-27', '2022-04-03', '2022-04-10', '2022-04-17',
               '2022-04-24', '2022-05-01'],
              dtype='datetime64[ns]', freq='W-SUN')